package siteCafeManagement;

public class siteCafeManagementMain {
	
	/*
	 사이트 카페 관리 콘솔 프로그램
	*DB 이용 필수(DB 학습 후 적용)*
	
	- 회원관리 (1) : 선진
		- 회원가입
		- 로그인
			-관리자 아이디라면 -> 관리자
			-사용자 아이디라면 ->사용자
		- 로그아웃

	
	- 관리자
	    - 카테고리 등록/수정/삭제 (2) : 경재
	    	- 카테고리 출력
	    		{
	    		-카테고리가 있다면
	    			- 카테고리 출력
	    		}
	    	- 삭제{
	    		1. 카테고리 삭제
	    		2. 만약 게시판이 있으면
	    			- 카테고리 내부 게시판 전부 삭제 (아진님이 만든 기능 불러오기)
    			}
	    - 게시판 등록/수정/삭제	(3) : 아진
	    게시판 삭제시{
	     	게시글이 있으면
	     		- 게시글 전부 삭제
	    }
	
	- 사용자 (4) : 나영
	    - 게시글 등록
	    - 게시글 조회
	    - 게시글 수정
	    - 게시글 삭제
	 
	 */

	public static void main(String[] args) {
		
	}

}
